jmeter/report_BS/statistics.json
{
  "B1 - POST /applications/submit" : {
    "transaction" : "B1 - POST /applications/submit",
    "sampleCount" : 8959,
    "errorCount" : 7936,
    "errorPct" : 88.581314,
    "meanResTime" : 447.7416006250715,
    "medianResTime" : 444.0,
    "minResTime" : 4.0,
    "maxResTime" : 1221.0,
    "pct1ResTime" : 697.0,
    "pct2ResTime" : 773.0,
    "pct3ResTime" : 908.0,
    "throughput" : 149.92887624466573,
    "receivedKBytesPerSec" : 30.616929937871305,
    "sentKBytesPerSec" : 153.59807429817587
  },
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 10634,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.21468873424875,
    "medianResTime" : 68.0,
    "minResTime" : 1.0,
    "maxResTime" : 567.0,
    "pct1ResTime" : 179.0,
    "pct2ResTime" : 227.0,
    "pct3ResTime" : 300.0,
    "throughput" : 178.47372572713692,
    "receivedKBytesPerSec" : 869.6005270484031,
    "sentKBytesPerSec" : 40.926545611793635
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 30173,
    "errorCount" : 7936,
    "errorPct" : 26.30166,
    "meanResTime" : 192.62844264739894,
    "medianResTime" : 112.0,
    "minResTime" : 1.0,
    "maxResTime" : 1221.0,
    "pct1ResTime" : 540.0,
    "pct2ResTime" : 651.0,
    "pct3ResTime" : 826.0,
    "throughput" : 504.94519287088946,
    "receivedKBytesPerSec" : 1054.0156975619195,
    "sentKBytesPerSec" : 238.15217476570996
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 10580,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.5691871455577,
    "medianResTime" : 69.0,
    "minResTime" : 1.0,
    "maxResTime" : 559.0,
    "pct1ResTime" : 183.0,
    "pct2ResTime" : 228.0,
    "pct3ResTime" : 311.0,
    "throughput" : 178.18347171463697,
    "receivedKBytesPerSec" : 157.29634633359717,
    "sentKBytesPerSec" : 44.02384603887027
  }
}