jmeter/report_BSKO/statistics.json
{
  "B1 - POST /applications/submit" : {
    "transaction" : "B1 - POST /applications/submit",
    "sampleCount" : 6961,
    "errorCount" : 6831,
    "errorPct" : 98.132454,
    "meanResTime" : 638.2715127136914,
    "medianResTime" : 629.0,
    "minResTime" : 4.0,
    "maxResTime" : 1997.0,
    "pct1ResTime" : 970.8000000000002,
    "pct2ResTime" : 1111.8999999999996,
    "pct3ResTime" : 1363.0,
    "throughput" : 115.90076590076589,
    "receivedKBytesPerSec" : 23.278885827713953,
    "sentKBytesPerSec" : 118.72130148497335
  },
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 7558,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 203.5275205080713,
    "medianResTime" : 194.0,
    "minResTime" : 2.0,
    "maxResTime" : 1073.0,
    "pct1ResTime" : 367.0,
    "pct2ResTime" : 424.0,
    "pct3ResTime" : 586.4099999999999,
    "throughput" : 125.91210475460635,
    "receivedKBytesPerSec" : 613.4343086745744,
    "sentKBytesPerSec" : 28.87440182171059
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 22017,
    "errorCount" : 6831,
    "errorPct" : 31.026026,
    "meanResTime" : 344.7763546350547,
    "medianResTime" : 282.0,
    "minResTime" : 2.0,
    "maxResTime" : 1997.0,
    "pct1ResTime" : 763.0,
    "pct2ResTime" : 913.9500000000007,
    "pct3ResTime" : 1204.9800000000032,
    "throughput" : 366.5834165834166,
    "receivedKBytesPerSec" : 746.5501783372877,
    "sentKBytesPerSec" : 178.4240661682068
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 7498,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 214.6801813817014,
    "medianResTime" : 196.0,
    "minResTime" : 2.0,
    "maxResTime" : 1075.0,
    "pct1ResTime" : 399.0,
    "pct2ResTime" : 461.0,
    "pct3ResTime" : 635.0,
    "throughput" : 125.33850422921333,
    "receivedKBytesPerSec" : 110.62261401532881,
    "sentKBytesPerSec" : 30.967423408194307
  }
}