jmeter/report_BSKO2/statistics.json
{
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 7845,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 245.21198215423632,
    "medianResTime" : 201.0,
    "minResTime" : 1.0,
    "maxResTime" : 1655.0,
    "pct1ResTime" : 396.0,
    "pct2ResTime" : 505.0,
    "pct3ResTime" : 954.2399999999998,
    "throughput" : 131.38282728475488,
    "receivedKBytesPerSec" : 1258.7943287511932,
    "sentKBytesPerSec" : 30.89817516872938
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 36146,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 202.3750069163951,
    "medianResTime" : 170.0,
    "minResTime" : 1.0,
    "maxResTime" : 1681.0,
    "pct1ResTime" : 269.0,
    "pct2ResTime" : 383.0,
    "pct3ResTime" : 690.6900000000496,
    "throughput" : 605.3186857353385,
    "receivedKBytesPerSec" : 3051.5005641474363,
    "sentKBytesPerSec" : 197.57865683194058
  },
  "B2 - POST /jobs/search" : {
    "transaction" : "B2 - POST /jobs/search",
    "sampleCount" : 10243,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 246.04578736698144,
    "medianResTime" : 202.0,
    "minResTime" : 1.0,
    "maxResTime" : 1622.0,
    "pct1ResTime" : 390.0,
    "pct2ResTime" : 519.0,
    "pct3ResTime" : 922.4799999999959,
    "throughput" : 172.06739572309297,
    "receivedKBytesPerSec" : 1652.2838888136453,
    "sentKBytesPerSec" : 43.8570217614524
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 7789,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 255.07972782128738,
    "medianResTime" : 213.0,
    "minResTime" : 1.0,
    "maxResTime" : 1681.0,
    "pct1ResTime" : 422.0,
    "pct2ResTime" : 525.5,
    "pct3ResTime" : 942.3000000000011,
    "throughput" : 130.86357526881721,
    "receivedKBytesPerSec" : 115.58304653372815,
    "sentKBytesPerSec" : 32.7158938172043
  },
  "B1 - POST /events/ingest" : {
    "transaction" : "B1 - POST /events/ingest",
    "sampleCount" : 10269,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 86.1131561008856,
    "medianResTime" : 42.0,
    "minResTime" : 2.0,
    "maxResTime" : 1362.0,
    "pct1ResTime" : 215.0,
    "pct2ResTime" : 300.0,
    "pct3ResTime" : 536.0,
    "throughput" : 172.3651744800846,
    "receivedKBytesPerSec" : 30.466891192280578,
    "sentKBytesPerSec" : 90.5590467483257
  }
}